// Завдання 1. Напишіть програму та рекурентне співвідношення для знаходження  ряду Фібоначчі від n, де n – номер варіанту за списком. Протестуйте роботу програми Яка Часова складність та допоміжний простір для виконання цього алгоритму?
// Математичне рівняння:
// n if n == 0, n == 1;
// fib(n) = fib(n-1) + fib(n-2) тощо;
// Рекурсивне відношення:
// T(n) = T(n-1) + T(n-2) + O(1)
// Рекурсивна програма:
// Вхідні дані: n = 5
// Вихідні дані:
// ряд Фібоначчі з 5 чисел: 0 1 1 2 3

#include <iostream>
using namespace std;

// Функція для знаходження числа Фібоначчі за номером n
int fib(int n) {
    // Базовий випадок: якщо n = 0 або n = 1, повертаємо n
    if (n == 0 || n == 1)  return n;
    // Рекурсивно знаходимо числа Фібоначчі для n-1 та n-2, і додаємо їх
    return fib(n - 1) + fib(n - 2);
}


int main() {
    int n; // Варіант n = 5
    // Вивід вхідних даних
    cout << "Input: n = ";
    cin >> n;
    // Вивід вихідних даних: ряд Фібоначчі для вказаного n
    cout << "Output:" << endl;
    cout << "Fibonacci series of " << n << " numbers: ";
    for (int i = 0; i < n; ++i)  cout <<   fib(i) << " ";
    cout << endl;

    return 0;
}
