// Завдання 2. Напишіть програму та рекурентне співвідношення для знаходження
// факторіалу n, де n >2.Протестуйте роботу програми Яка Часова складність та
// Допоміжний простір для виконання цього алгоритму?

// Математичне рівняння:
// 1 if n == 0 or n == 1;
// f(n) = n*f(n-1) if n> 1;

// Рекурсивне відношення:
// T(n) = 1 for n = 0
// T(n) = 1 + T(n-1) for n > 0
// Рекурсивна програма:
// Вхідні дані: n = 5
// Вихідні дані:
// факторіал 5 дорівнює: 120

#include <iostream>
using namespace std;

// Функція для знаходження факторіалу числа n
int factorial(int n) {
    // Базовий випадок: якщо n = 0 або n = 1, повертаємо 1
    if (n == 0 || n == 1)  return 1;
    // Рекурсивно знаходимо факторіал для n-1, та множимо на n
    return n * factorial(n - 1);
}

int main() {
    int n; // Вхідне число n
    cout << "Input n: ";
    cin >> n;
    cout << "Output:" << endl;
    cout << "Factorial " << n << " : " << factorial(n) << endl;

    return 0;
}

