/*
Завдання 6. Двійковий пошук:
У заданому масиві, відсортованому за зростанням, необхідно знайти значення елемента рівного
значенню Х, використовуючи двійковий пошук. X вводиться із клавіатури. Доопрацюйте програму,
щоб вона вирішувала задачу Нумерація елементів починається з нуля. Якщо такого елемента
немає, програма повинна виводити Not found. Яка часова та просторова складність алгоритму?
*/
#include<iostream>
using namespace std;

int main() {
    const int Nmax = 1000;
    int A[Nmax], i, L, R, X, N, c;
    cin >> N;
    for (i = 0; i < N; i++) cin >> A[i];
    cin >> X;
    L = 0; R = N;
    while (L < R) {
        int mid = L + (R - L) / 2;
        if (A[mid] == X) {
            cout << "A[" << mid << "]=" << X;
            return 0;
        }
        else if (A[mid] < X) L = mid + 1;
        else                 R = mid;
    }
    cout << "Not found";
    return 0;
}
/*
Просторова складність алгоритму становить O(1)
Часова складність алгоритму становить O(log N)
*/