/*
Завдання 1. Пошук масимуму:
Знайти у масиві максимальний із від’ємних елементів. Додайте умову всередині циклу (після слова
if), щоб програма знаходила максимальний елемент серед від’ємних елементів.
*/

#include <iostream>
using namespace std;

int main() {
    const int Nmax = 1000;
    int A[Nmax], i, M, N;
    cin >> N;
    for (i = 0; i < N; i++) cin >> A[i];
    M = -1; // Початкове значення максимуму
    for (i = 0; i < N; i++)
        //Додайте правильну умову, щоб задача виконалась правильно
        if(A[i] < 0) if (M == -1 || M < A[i]) M = A[i];
    cout << M;
    return 0;
}
