/*
Завдання 5. Лінійний пошук:
У заданому масиві необхідно знайти значення елемента, що дорівнює значенню Х. X вводиться із
клавіатури. Допрацюйте програму в потрібних рядках, щоб вирішувати завдання. Нумерація
елементів починається із нуля. Якщо такого елемента немає, програма повинна виводити Not
found. Яка часова та просторова складність алгоритму?
*/
#include<iostream>

using namespace std;
main(){
    const int Nmax=1000;
    int A[Nmax], i, M, N, X;
    cin >> N;
    for (i=0; i<N; i++) cin >> A[i];
    cin >> X;
    int nX=-1; // оберіть правильний тип даних для змінної
    for (i=0; i<N; i++)
        if (A[i]==X) {
            nX = i; //якщо знайшли вказаний елемент,  то запам’ятовуємо его номер
            break;  // додайте сюди оператор дострокового виходу з циклу
        }
    if (nX != -1) // додайте сюди необхідну умову
        cout << "A["<< i << "]=" << X;
    else
        cout << "Not found";
    return 0;
}

/*
Часова складність O(N)
Просторова складність O(1), 
*/