/*
Завдання 3. Пошук помилки:
Розгляньте фрагмент програми, яка знаходить у масиві елемент 5. З наведених нижче значень
змінної Х виберіть те, що призведе до неправильного результату:
1 \n 3 \n 5 \n 4
У відповіді вкажіть значення змінної Х із вказаних значень, обґрунтуйте відповідь.
*/
#include<iostream>
using namespace std;
main(){
    int A[5]={1, 5, 3, 2, 5}, i=0, X;
    cin >> X;
    while (A [i] != X) i++;
    cout << "A[" << i << "]=" << X;
}
/*
Відповідь 4, оскільки вона відсутня в масиві.
*/